app/controllers/admin_controller.rb

  def update
     @user.update(user_params)
---
UPDATE "users" SET "password_digest" = $1, "admin" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$10$vLuFW5yJDjnJpWtnCAESPOnB5En7hLv1nXKYnOKh6uT2xIsTXv8zq"], ["admin", "f"], ["updated_at", "2016-09-29 12:12:37.240115"], ["id", 5]]

  def create
   @user= User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
     if @user.admin == true
       flash[:now] = "Admins can't be deleted"
       redirect_to '/admin/index'
     else
       @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]