app/controllers/login_controller.rb

  def verify_login
    @user = User.find_by(name: "#{params[:name]}").try(:authenticate,"#{params[:password]}")
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "test"]]

  def create
   @user= User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["password_digest", "$2a$10$pIyt2sgAKZiakWRX57j/bO8OBrgCcGYuEz/bXgrq2EdJcgce3YXbG"], ["created_at", "2016-09-20 12:40:22.567174"], ["updated_at", "2016-09-20 12:40:22.567174"]]