app/controllers/users_controller.rb

  def index
      @user = User.all
---
SELECT  "users".* FROM "users" WHERE (test) LIMIT 1